# BuiltInFailures.StructuralConnectionFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralConnectionFailures Class
BuiltInFailures Class Members See Also
---
Failures about StructuralConnectionHandler.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class StructuralConnectionFailures
```

Visual Basic
---
```text
Public NotInheritable Class StructuralConnectionFailures
```

Visual C++
---
```text
public ref class StructuralConnectionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..StructuralConnectionFailures
# See Also
BuiltInFailures..::..StructuralConnectionFailures Members
Autodesk.Revit.DB Namespace